In [2]:
import os
import pandas as pd
import numpy as np

In [3]:
os.listdir("data")

['departments.csv',
 'dept_emp.csv',
 'dept_manager.csv',
 'employees.csv',
 'salaries.csv',
 'titles.csv']

In [6]:
#Per Alexander's suggestion:
prefix = "data/"

files = os.listdir("data")
dfs = []

for file in files:
    path = prefix + file
    df = pd.read_csv(path)
    dfs.append({"file": file, "df" : df})

In [7]:
dfs[0]

{'file': 'departments.csv',
 'df':   dept_no           dept_name
 0    d001           Marketing
 1    d002             Finance
 2    d003     Human Resources
 3    d004          Production
 4    d005         Development
 5    d006  Quality Management
 6    d007               Sales
 7    d008            Research
 8    d009    Customer Service}

In [8]:
for data in dfs:
    print(data["file"])
    display(data["df"].head())

departments.csv

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

dept_emp.csv

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

dept_manager.csv

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

employees.csv

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991

salaries.csv

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

titles.csv

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer